#pragma once
//確認用のファイルです。追加する時はここに書き込んでください

//**************************************************************************
//ヘッダーファイル情報
//**************************************************************************

//GameClear.h：ステージクリア、ゲームクリアに必要な情報
//GameOver.h:ゲームオーバーに必要な情報
//GamePlay.h:ゲーム本編に必要な情報
//GameScene.h:シーンの切り替えに必要な情報
//GameTitle.h:タイトルに必要な情報

//hiroaki.h:兼次さんが必要な情報（主にプレイヤー関係)
//issei.h:いっせいが必要な情報(ギミック関係)
//tubasa.h:つばささんが必要な情報（UI・UX他）
//yoshitaka.h:よしたかが必要な情報（マップ関係）
//yu-ki.h:ゆうきさんが必要な情報（ギミック関係）

//KeyControl.h:キーボード制御の変数、等
//Map.h:マップの情報等、マップチップもここにあり
//Picture.h:画像変数など
//player.h:プレイヤーの変数などなど、
//StageSelect.h:ステージセレクトの関数宣言
//Struct.h:その他関数、変数をぶち込む用、現在はデバッグのマウス処理が主
//Gimmick.h:ギミック関連の変数、関数がある所

//**************************************************************************
//ソースファイル情報
//**************************************************************************

//GameClear・GameOver・GamePlay・GameTitle.cpp:右からクリア画面、ゲームオーバー画面、ゲーム本編、ゲームタイトルのプログラムを書くところ
//LoadPicture.cpp:画像のロード
//MainSource.cpp:ゲーム全体の管理を行う、メインプログラム
//PlayerMove.cpp:プレイヤーの動きを制御するプログラム
//StageInit.cpp:ステージ初期化プログラム
//StageSelect.cpp:ステージセレクトプログラム
//Gimmick.cpp:ギミックプロググラムを書く所